;;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el



(package! gruber-darker-theme)
(package! multi-vterm)
(package! beacon)
(package! nyan-mode)
(package! prettier)
(package! recentf)
(package! fzf)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! treemacs)
(package! company-go)
(package! prettier-js)
(package! add-node-modules-path)
(package! obsidian)
(package! battle-haxe)
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))


;;(unpin! t)
